<?php

$questions97 = [
    "1. Я человек, с которым очень легко поладить."                                                                            ,
    "2. Когда я чего-то хочу, у меня не хватает терпения подождать."                                                           ,
    "3. Всегда был такой человек, на которого я хотел бы походить."                                                            ,
    "4. Люди считают меня сдержанным, рассудительным человеком."                                                               ,
    "5. Мне противны непристойные кинофильмы."                                                                                 ,
    "6. Я редко помню свои сны."                                                                                               ,
    "7. Люди, которые всюду распоряжаются, приводят меня в бешенство."                                                         ,
    "8. Иногда у меня возникает желание пробить кулаком стену."                                                                ,
    "9. Меня сильно раздражает, когда люди рисуются."                                                                          ,
    "10. В своих фантазиях я всегда главный герой."                                                                            ,
    "11. У меня не очень хорошая память на лица."                                                                              ,
    "12. Я чувствую некоторую неловкость, пользуясь общественной баней."                                                       ,
    "13.Я всегда внимательно выслушиваю все точки зрения в споре."                                                             ,
    "14. Я легко выхожу из себя, но быстро успокаиваюсь."                                                                      ,
    "15. Когда в толпе кто-то толкает меня, я испытываю желание ответить тем же."                                              ,
    "16. Многое во мне восхищает людей."                                                                                       ,
    "17. Отправляясь в поездку, я обязательно планирую каждую деталь."                                                         ,
    "18. Иногда, без всякой причины, на меня нападает упрямство."                                                              ,
    "19. Друзья почти никогда не подводят меня."                                                                               ,
    "20. Мне случалось думать о самоубийстве."                                                                                 ,
    "21. Меня оскорбляют непристойные шутки."                                                                                  ,
    "22. Я всегда вижу светлые стороны вещей."                                                                                 ,
    "23. Я ненавижу недоброжелательных людей."                                                                                 ,
    "24. Если кто-нибудь говорит, что я не смогу что-то сделать, то я нарочно хочу сделать это, чтобы доказать ему неправоту." ,
    "25. Я испытываю затруднения, вспоминая имена людей."                                                                      ,
    "26. Я склонен к излишней импульсивности."                                                                                 ,
    "27. Я терпеть не могу людей, которые добиваются своего, вызывая к себе жалость"                                           ,
    "28. Я ни к кому не отношусь с предубеждением."                                                                            ,
    "29. Иногда меня беспокоит, что люди подумают, будто я веду себя странно, глупо или смешно."                               ,
    "30.Я всегда нахожу логичные объяснения любым неприятностям."                                                              ,
    "31. Иногда мне хочется увидеть конец света."                                                                              ,
    "32. Порнография отвратительна."                                                                                           ,
    "33. Иногда, будучи расстроен, я ем больше обычного."                                                                      ,
    "34. У меня нет врагов."                                                                                                   ,
    "35. Я не очень хорошо помню свое детство."                                                                                ,
    "36. Я не боюсь состариться, потому что это происходит с каждым."                                                          ,
    "37. В своих фантазиях я совершаю великие дела."                                                                           ,
    "38. Большинство людей раздражают меня, потому что они слишком эгоистичны."                                                ,
    "39. Прикосновение к чему-либо склизкому вызывает во мне омерзение."                                                       ,
    "40. У меня часто бывают яркие, сюжетные сновидения."                                                                      ,
    "41.Я убежден, что если буду неосторожен, люди воспользуются этим."                                                        ,
    "42. Я не скоро замечаю дурное в людях."                                                                                   ,
    "43. Когда я читаю или слышу о трагедии, это не слишком трогает меня."                                                     ,
    "44. Когда есть повод рассердиться, я предпочитаю основательно все обдумать."                                              ,
    "45. Я испытываю сильную потребность в комплиментах."                                                                      ,
    "46. Сексуальная невоздержанность отвратительна."                                                                          ,
    "47. Когда в толпе кто-то мешает моему движению, у меня иногда возникает желание толкнуть его плечом."                     ,
    "48. Как только что-нибудь не по-моему, я обижаюсь и мрачнею."                                                             ,
    "49. Когда я вижу окровавленного человека на экране, это почти не волнует меня."                                           ,
    "50. В сложных жизненных ситуациях я не могу обойтись без поддержки и помощи людей."                                       ,
    "51. Большинство окружающих считают меня очень интересным человеком."                                                      ,
    "52. Я ношу одежду, которая скрывает недостатки моей фигуры."                                                              ,
    "53. Для меня очень важно всегда придерживаться общепринятых правил поведения."                                            ,
    "54. Я склонен часто противоречить людям."                                                                                 ,
    "55. Почти во всех семьях супруги друг другу изменяют."                                                                    ,
    "56. По-видимому, я слишком отстранённо смотрю на вещи."                                                                   ,
    "57. В разговорах с представителями противоположного пола я стараюсь избегать щекотливых тем."                             ,
    "58. Когда у меня что-то не получается, мне иногда хочется плакать."                                                       ,
    "59. Из моей памяти часто выпадают некоторые мелочи."                                                                      ,
    "60. Когда кто-то толкает меня, я испытываю сильное негодование."                                                          ,
    "61. Я выбрасываю из головы то, что мне не нравится."                                                                      ,
    "62. В любой неудаче я обязательно нахожу положительные стороны."                                                          ,
    "63. Я терпеть не могу людей, которые всегда стараются быть в центре внимания."                                            ,
    "64. Я почти ничего не выбрасываю и бережно храню множество разных вещей."                                                 ,
    "65. В компании друзей мне больше всего нравятся разговоры о прошедших событиях, развлечениях и удовольствиях."             ,
    "66. Меня не слишком раздражает детский плач."                                                                             ,
    "67. Мне случалось так разозлиться, что я готов был перебить все вдребезги."                                               ,
    "68. Я всегда оптимистичен. "                                                                                               ,
    "69. Я чувствую себя неуютно, когда на меня не обращают внимания."                                                          ,
    "70. Какие бы страсти не разыгрывались на экране, я всегда отдаю себе отчет в том, что это только на экране."               ,
    "71. Я часто испытываю чувство ревности."                                                                                  ,
    "72. Я бы никогда специально не пошел на откровенно эротический фильм."                                                     ,
    "73. Неприятно то, что людям, как правило, нельзя доверять."                                                                ,
    "74. Я готов почти на все, чтобы произвести хорошее впечатление."                                                           ,
    "75. Я никогда не бывал панически испуган."                                                                                ,
    "76. Я не упущу случая посмотреть хороший триллер или боевик."                                                              ,
    "77. Я думаю, что ситуация в мире лучше, чем полагает большинство людей."                                                   ,
    "78. Даже небольшое разочарование может привести меня в уныние."                                                            ,
    "79. Мне не нравится, когда люди откровенно флиртуют."                                                                      ,
    "80. Я никогда не позволяю себе терять самообладание."                                                                      ,
    "81. Я всегда готовлюсь к неудаче, чтобы не быть застигнутым врасплох."                                                     ,
    "82. Кажется, некоторые из моих знакомых завидуют моему умению жить."                                                       ,
    "83. Мне случалось со зла так сильно ударить или пнуть по чему-нибудь, что я неумышленно причинял себе боль."               ,
    "84. Я знаю, что за глаза кое-кто отзывается обо мне дурно."                                                               ,
    "85. Я едва ли могу вспомнить свои первые школьные годы."                                                                  ,
    "86. Когда я расстроен, я иногда веду себя по-детски."                                                                     ,
    "87. Мне намного проще говорить о своих мыслях, чем о своих чувствах."                                                     ,
    "88. Когда я бываю в отъезде и у меня случаются неприятности, я сразу начинаю сильнотосковать по дому."                    ,
    "89. Когда я слышу о жестокостях, это не слишком глубоко трогает меня."                                                    ,
    "90. Я легко переношу критику и замечания."                                                                                ,
    "91. Я не скрываю своего раздражения по поводу привычек некоторых членов моей семьи."                                       ,
    "92. Я знаю, что есть люди, настроенные против меня."                                                                      ,
    "93. Я не могу переживать свои неудачи в одиночку."                                                                        ,
    "94. К счастью, у меня меньше проблем, чем имеет большинство людей."                                                       ,
    "95. Если что-то волнует меня, я иногда испытываю усталость и желание выспаться."                                        ,
    "96. Отвратительно то, что почти все люди, добившиеся успеха, достигли его с помощью лжи."                                 ,
    "97. Нередко я испытываю желание почувствовать в своих руках пистолет или автомат."                                        ,
];

$questions50 = [
    "1. ...я сосредотачивался на том, что мне нужно было делать дальше – на следующем шаге." ,
    "2...начинал что-то делать, зная, что это все равно не будет работать, главное - делать хоть что-нибудь." ,
    "3. ...пытался склонить вышестоящих к тому, чтобы они изменили свое мнение." ,
    "4. ... говорил с другими, чтобы больше узнать о ситуации." ,
    "5. ... критиковал и укорял себя." ,
    "6. ... пытался не сжигать за собой мосты, оставляя все, как оно есть." ,
    "7. ... надеялся на чудо.",
    "8. ... смирялся с судьбой: бывает, что мне не везет." ,
    "9. ... вел себя, как будто ничего не произошло." ,
    "10. ... старался не показывать своих чувств." ,
    "11. ... пытался увидеть в ситуации что-то положительное." ,
    "12. ... спал больше обычного.",
    "13. ... срывал свою досаду на тех, кто навлек на меня проблемы." ,
    "14. ... искал сочувствия и понимания у кого-нибудь." ,
    "15. ... во мне возникла потребность выразить себя творчески.",
    "16. ... пытался забыть все это.",
    "17. ... обращался за помощью к специалистам.",
    "18. ... менялся или рос как личность в положительную сторону.",
    "19. ... извинялся или старался все загладить.",
    "20. … составлял план действии.",
    "21. ... старался дать какой-то выход своим чувствам.",
    "22. ... понимал, что сам вызвал эту проблему.",
    "23. ... набирался опыта в этой ситуации.",
    "24. ... говорил с кем-либо, кто мог конкретно помочь в этой ситуации.",
    "25. ... пытался улучшить свое самочувствие едой, выпивкой, курением или лекарствами.",
    "26. ... рисковал напропалую.",
    "27. ... старался действовать не слишком поспешно, доверяясь первому по­рыву.",
    "28. ... находил новую веру во что-то.",
    "29. ... вновь открывал для себя что-то важное." ,
    "30. ... что-то менял так, что все улаживалось." ,
    "31. ... в целом избегал общения с людьми." ,
    "32. ... не допускал это до себя, стараясь об этом особенно не задумываться.",
    "33. ... спрашивал совета у родственника или друга, которых уважал.",
    "34. ... старался, чтобы другие не узнали, как плохо обстоят дела.",
    "35. ... отказывался воспринимать это слишком серьезно.",
    "36. ... говорил о том, что я чувствую.",
    "37. ... стоял на своем и боролся за то, чего хотел.",
    "38. ... вымещал это на других людях.",
    "39. ... пользовался прошлым опытом - мне приходилось уже попадать в такие ситуации.",
    "40. ... знал, что надо делать и удваивал свои усилия, чтобы все наладить.",
    "41. … отказывался верить, что это действительно произошло.",
    "42. ... я давал обещание, что в следующий раз все будет по-другому.",
    "43. ... находил пару других способов решения проблемы.",
    "44. ... старался, что мои эмоции не слишком мешали мне в других делах.",
    "45. ... что-то менял в себе.",
    "46. ... хотел, чтобы все это скорее как-то образовалось или кончилось.",
    "47. ... представлял себе, фантазировал, как все это могло бы обернуться.",
    "48. ... молился.",
    "49. .. прокручивал в уме, что мне сказать или сделать.",
    "50. ... думал о том, как бы в данной ситуации действовал человек, которым я восхищаюсь и старался подражать ему."
];

$questions57 = [
    "1. Думаю, что большинство моих знакомых относится ко мне с симпатией.",
    "2. Мои слова не так уж часто расходятся с делом.",
    "3.Думаю, что многие видят во мне что-то сходное с собой.",
    "4. Когда я пытаюсь себя оценить, я прежде всего вижу свои недостатки.",
    "5. Думаю, что как личность я вполне могу быть притягательным для других.",
    "6. Когда я вижу себя глазами любящего меня человека, меня неприятно поражает то, насколько мой образ далек от действительности.",
    "7. Мое «Я» всегда мне интересно.",
    "8. Я считаю, что иногда не грех пожалеть самого себя.",
    "9. В моей жизни есть или по крайней мере были люди с которыми я был чрезвычайно близок.",
    "10. Собственное уважение мне еще надо заслужить.",
    "11. Бывало, и не раз, что я сам себя остро ненавидел.",
    "12. Я вполне доверяю своим внезапно возникшим желаниям.",
    "13. Я сам хотел во многом себя переделать.",
    "14. Мое собственное «Я» не представляется мне чем-то достойным глубокого внимания.",
    "15. Я искренне хочу, чтобы у меня было все хорошо в жизни.",
    "16. Если я и отношусь к кому-нибудь с укоризной, то прежде всего к самому себе.",
    "17. Случайному знакомому я скорее всего покажусь человеком приятным.",
    "18. Чаще всего я одобряю свои планы и поступки.",
    "19. Собственные слабости вызывают у меня что-то наподобие презрения.",
    "20. Если бы я раздвоился, то мне было бы довольно интересно общаться со своим двойником.",
    "21. Некоторые свои качества я ощущаю как посторонние, чужие мне.",
    "22. Вряд ли кто-либо сможет почувствовать свое сходство со мной.",
    "23. У меня достаточно способностей и энергии воплотить в жизнь задуманное.",
    "24. Часто я не без издевки подшучиваю над собой",
    "25. Самое разумное, что может сделать человек в своей жизни – это подчиниться собственной судьбе.",
    "26. Посторонний человек, на первый взгляд, найдет во мне много отталкивающего.",
    "27. К сожалению, если я и сказал что-то, это не значит, что именно так и буду поступать.",
    "28. Свое отношение к самому себе можно назвать дружеским.",
    "29. Быть снисходительным к собственным слабостям вполне естественно.",
    "30. У меня не получается быть для любимого человека интересным длительное время.",
    "31. В глубине души я бы хотел, чтобы со мной произошло что-то катастрофическое.",
    "32. Вряд ли я вызываю симпатию у большинства моих знакомых.",
    "33. Мне бывает очень приятно увидеть себя глазами любящего меня человека.",
    "34. Когда у меня возникает какое-либо желание, я прежде всего спрашиваю у себя, разумно ли это." ,
    "35. Иногда мне кажется, что если бы какой-то мудрый человек смог увидеть меня насквозь, он бы тут же понял, какое я ничтожество.",
    "36. Временами я сам собой восхищаюсь.",
    "37. Можно сказать, что я ценю себя достаточно высоко.",
    "38. В глубине души я никак не могу поверить, что я действительно взрослый человек." ,
    "39. Без посторонней помощи я мало что могу сделать.",
    "40. Иногда я сам себя плохо понимаю." ,
    "41. Мне очень мешает недостаток энергии, воли и целеустремленности.",
    "42. Думаю, что другие в целом оценивают меня достаточно высоко.",
    "43. В моей личности есть, наверное, что-то такое, что способно вызывать у других неприязнь." ,
    "44. Большинство моих знакомых не принимают меня так уж всерьез." ,
    "45. Сам у себя я довольно часто вызываю чувство раздражения.",
    "46. Я вполне могу сказать, что унижаю себя сам.",
    "47. Даже мои негативные черты не кажутся мне чужими.",
    "48. В целом, меня устраивает то, какой я есть.",
    "49. Вряд ли меня можно любить по-настоящему." ,
    "50. Моим мечтам и планам не хватает реалистичности.",
    "51. Если бы мое второе «Я» существовало, то для меня это был бы самый скучный партнер по общению." ,
    "52. Думаю, что мог бы найти общий язык с любым разумным и знающим человеком.",
    "53. То, что во мне происходит, как правило, мне понятно.",
    "54. Мои достоинства вполне перевешивают мои недостатки.",
    "55. Вряд ли найдется много людей, которые обвинят меня в отсутствии совести.",
    "56. Когда со мной случаются неприятности, как правило, я говорю: «И поделом тебе»." ,
    "57. Я могу сказать, что в целом я контролирую свою судьбу.",
];

$last_questions = [
    "1. Здоровье" ,
    "2. Ум и способности",
    "3. Характер",
    "4. Отношение к окружающим",
    "5. Внешность",
    "6. Авторитет у сверстников",
    "7. Уверенность в себе"
];

?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="utf-8">
    <script
            src="https://code.jquery.com/jquery-3.3.1.min.js"
            integrity="sha256-FgpCb/KJQlLNfOu91ta32o/NMZxltwRo8QtmkMRdAu8="
            crossorigin="anonymous"></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.12.9/umd/popper.min.js" integrity="sha384-ApNbgh9B+Y1QKtv3Rn7W3mgPxhU9K/ScQsAP7hUibX39j7fakFPskvXusvfa0b4Q" crossorigin="anonymous"></script>
    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
    <script src="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/js/bootstrap.min.js" integrity="sha384-JZR6Spejh4U02d8jOt6vLEHfe/JQGiRRSQQxSfFWpi1MquVdAyjUar5+76PVCmYl" crossorigin="anonymous"></script>
    <script src="jquery-ui.min.js"></script>
    <link rel="stylesheet" href="jquery-ui.min.css">
    
    <script>
        window.onload = function () {
            for (let i = 0; i < 7; i++) {
                let elem = $('#slider-vertical' + i);
                (function (i) {
                    elem.slider({
                        orientation: "vertical",
                        range: "min",
                        min: 0,
                        max: 100,
                        value: 0,
                        slide: function (event, ui) {
                            $("#amount" + i).val(ui.value);
                        }
                    });
                })(i);
                $("#amount" + i).val(elem.slider("value"));
            }
        }

    </script>

    <style>
        .ui-slider-range {
            background: #50c1ff !important;
        }

        .ui-slider-vertical {
            background: #50c1ff !important;
        }
        .ui-slider-handle {
            /*padding-top: 3px !important;*/
            /*padding-bottom: 3px !important;*/
        }

        body {
            background: #e1e1e1;
        }

        hr {
            display: block;
            size: 30px;
            border: 0;
            border-top: 1px solid #559ecc;
            margin: 1em 0;
            padding: 0;
        }

        .main-container {
            margin-top: 20px;
            margin-bottom: 20px;
            border-radius: 7px;
            background: white;
            box-shadow: 0 0 10px #252529;
        }

        article {
            padding: 20px 10px;
        }
        
    </style>

</head>
<body>

<div class="container main-container">
    <article>
        <h3>Добро пожаловать</h3>
        <p>Спасибо, что Вы согласились поучаствовать в нашем исследовании!
            Вас ждут 4 части опросника, ответы на них помогут нам узнать о взаимосвязи между самооценкой и стратегиями поведения, которые помогают человеку справляться со стрессом и другими трудными жизненными ситуациями.
            Заполняя опросник, не думайте слишком долго, отвечайте то, что первое приходит к Вам в голову! Помните, здесь нет правильных или неправильных ответов! В общей сложности это может занять у Вас около 20 -40 минут.
            Ваши результаты будут записаны анонимно, и использованы только во благо науки!

            Большое спасибо за Вашу помощь!
        </p>

        <form action="https://script.google.com/macros/s/AKfycbwjCC_KgMlDcUN_-Ge2Hpck9EBQ-0qrtaqlmjyOK16lIkT16Rc/exec" id="gform-jquerya" method="POST" >

            <hr>
            <h3>Немного информации о Вас)</h3>

            <p>Ваш пол:</p>
            <div class="form-check">
                <input type="radio" class="form-check-input" value="М" id="Mpol" name="Ваш пол?">
                <label class="form-check-label" for="Mpol">М</label>
            </div>
            <div class="form-check">
                <input type="radio"  class="form-check-input" value="Ж" id="JPol" name="Ваш пол?">
                <label class="form-check-label" for="JPol">Ж</label>
            </div>

            <div class="form-group">
                <label for="age">Ваш возраст:</label>
                <input type="text" class="form-control" id="age" name="Ваш возраст?">
            </div>

            <div class="form-group">
                <label for="education">Ваше образованиe:</label>
                <input type="text" id="education" class="form-control" name="Ваше образование?">
            </div>

            <hr>

            <h3>Начнем!</h3>
            <p>Вам будут предложены 97 утверждений, с которыми Вы можете согласиться или не согласиться выбрав ответ "ДА" или "НЕТ".</p>
            <?php $i = 0; ?>
            <?php foreach($questions97 as $question): ?>
                <p><?php echo $question ?></p>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "1" ?>" value="Да" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "1"?>">Да</label>
                </div>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "2" ?>" value="Нет" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "2"?>">Нет</label>
                </div>
                <?php $i++; ?>
            <?php endforeach; ?>

            <br>
            <hr>
            <h3>Отдохните немного)</h3>
            <p>Вас ждут 50 утверждений, которые касаются поведения в трудных жизненных ситуациях.Оцените, как часто то или иное поведение встречается у Вас.</p>
            <h3>ОКАЗАВШИСЬ В ТРУДНОЙ СИТУАЦИИ, ...</h3>
            <?php $i = 0; ?>
            <?php foreach ($questions50 as $question): ?>
                <p><?php echo $question ?></p>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "1" ?>" value="Никогда" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "1"?>">Никогда</label>
                </div>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "2" ?>" value="Редко" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "2"?>">Редко</label>
                </div>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "3" ?>" value="Иногда" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "3"?>">Иногда</label>
                </div>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "4" ?>" value="Часто" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "4"?>">Часто</label>
                </div>
                <?php $i++; ?>
            <?php endforeach; ?>

            <br>
            <hr>
            <h3>Вы молодец! Немного разомнитесь!</h3>
            <p>Вам предлагается ответить на следующие 57 утверждений. Если Вы согласны с данным утверждением отмечайте "да", если не согласны, то выбирайте ответ "нет".
            </p>

            <?php $i = 0; ?>
            <?php foreach ($questions57 as $question): ?>
                <p><?php echo $question ?></p>
                <input type="radio" id="<?php echo $question . "1" ?>" value="Да" name="<?php echo $question ?>">
                <label for="<?php echo $question . "1"?>">Да</label>
                <input type="radio" id="<?php echo $question . "2" ?>" value="Нет" name="<?php echo $question ?>">
                <label for="<?php echo $question . "2"?>">Нет</label>
                <?php $i++; ?>
            <?php endforeach; ?>

            <br>
            <hr>
            <h3>Последний рывок! Здесь совсем чуть-чуть!</h3>
            <p>
                В этой части Вам нужно будет оценить самого себя с помощью 10-ми бальной шкалы по ниже перечисленным параметрам, где 1- это самый минимальный показатель, а 10- максимальный. Например, если бы все люди разделились по росту, тогда 1- это самый маленький рост на земле, а 10- самый высокий. Вам нужно выбрать, где находитесь Вы, относительно этих параметров!
            </p>

            <?php $i = 0; ?>
            <?php foreach ($last_questions as $question): ?>
                <div style="margin-top: 70px;">
                    <div class="row">
                        <p><?php echo $question ?></p>
                    </div>
                    <div class="form-check">
                        <div id="slider-vertical<?php echo $i; ?>" style="height:400px;"></div>
                        <p>
                            <input hidden class="form-check-input" type="text" name="<?php echo $question ?>" id="amount<?php echo $i; ?>" style="border:0; color:#f6931f; font-weight: lighter;" />
                        </p>
                    </div>
                </div>
                <?php $i++; ?>
            <?php endforeach; ?>

<!--            <input name="pageHistory" value="0,1,2,3,4,5" type="hidden">-->
<!--            <input name="fbzx" value="4444996217337404207" type="hidden">-->
            <button type="submit" class="btn btn-primary">Submit</button>
        </form>
    </article>
</div>
</body>
</html>


