<?php

$questions97 = [
    "1. Я человек, с которым очень легко поладить. *" =>                                                                           "entry.202116079",
    "2. Когда я чего-то хочу, у меня не хватает терпения подождать. *" =>                                                          "entry.1948861502",
    "3. Всегда был такой человек, на которого я хотел бы походить. *" =>                                                           "entry.790211294" ,
    "4. Люди считают меня сдержанным, рассудительным человеком. *" =>                                                              "entry.200040479" ,
    "5. Мне противны непристойные кинофильмы. *" =>                                                                                "entry.2055521263",
    "6. Я редко помню свои сны. *" =>                                                                                              "entry.1125242172",
    "7. Люди, которые всюду распоряжаются, приводят меня в бешенство. *" =>                                                        "entry.222887384" ,
    "8. Иногда у меня возникает желание пробить кулаком стену. *" =>                                                               "entry.1214673787",
    "9. Меня сильно раздражает, когда люди рисуются. *" =>                                                                         "entry.2079836092",
    "10. В своих фантазиях я всегда главный герой. *" =>                                                                           "entry.541147888" ,
    "11. У меня не очень хорошая память на лица. *" =>                                                                             "entry.380993545" ,
    "12. Я чувствую некоторую неловкость, пользуясь общественной баней. *" =>                                                      "entry.178167155" ,
    "13.Я всегда внимательно выслушиваю все точки зрения в споре. *" =>                                                            "entry.579863029" ,
    "14. Я легко выхожу из себя, но быстро успокаиваюсь. *" =>                                                                     "entry.1453252692",
    "15. Когда в толпе кто-то толкает меня, я испытываю желание ответить тем же. *" =>                                             "entry.1571840155",
    "16. Многое во мне восхищает людей. *" =>                                                                                      "entry.811877361" ,
    "17. Отправляясь в поездку, я обязательно планирую каждую деталь. *" =>                                                        "entry.1630323400",
    "18. Иногда, без всякой причины, на меня нападает упрямство. *" =>                                                             "entry.1876822490",
    "19. Друзья почти никогда не подводят меня. *" =>                                                                              "entry.496817478" ,
    "20. Мне случалось думать о самоубийстве. *" =>                                                                                "entry.936617042" ,
    "21. Меня оскорбляют непристойные шутки. *" =>                                                                                 "entry.1026491741",
    "22. Я всегда вижу светлые стороны вещей. *" =>                                                                                "entry.536566774" ,
    "23. Я ненавижу недоброжелательных людей. *" =>                                                                                "entry.1679601958",
    "24. Если кто-нибудь говорит, что я не смогу что-то сделать, то я нарочно хочу сделать это, чтобы доказать ему неправоту. *" =>"entry.1239971578",
    "25. Я испытываю затруднения, вспоминая имена людей. *" =>                                                                     "entry.1511497195",
    "26. Я склонен к излишней импульсивности. *" =>                                                                                "entry.355959289" ,
    "27. Я терпеть не могу людей, которые добиваются своего, вызывая к себе жалость *" =>                                          "entry.1314581703",
    "28. Я ни к кому не отношусь с предубеждением. *" =>                                                                           "entry.317946054" ,
    "29. Иногда меня беспокоит, что люди подумают, будто я веду себя странно, глупо или смешно. *" =>                              "entry.2045630254",
    "30.Я всегда нахожу логичные объяснения любым неприятностям. *" =>                                                             "entry.654840195" ,
    "31. Иногда мне хочется увидеть конец света. *" =>                                                                             "entry.1965147921",
    "32. Порнография отвратительна. *" =>                                                                                          "entry.1017663913",
    "33. Иногда, будучи расстроен, я ем больше обычного. *" =>                                                                     "entry.1015400209",
    "34. У меня нет врагов. *" =>                                                                                                  "entry.715713965" ,
    "35. Я не очень хорошо помню свое детство. *" =>                                                                               "entry.415062731" ,
    "36. Я не боюсь состариться, потому что это происходит с каждым. *" =>                                                         "entry.2112412644",
    "37. В своих фантазиях я совершаю великие дела. *" =>                                                                          "entry.504276278" ,
    "38. Большинство людей раздражают меня, потому что они слишком эгоистичны. *" =>                                               "entry.694477659" ,
    "39. Прикосновение к чему-либо склизкому вызывает во мне омерзение. *" =>                                                      "entry.665363704" ,
    "40. У меня часто бывают яркие, сюжетные сновидения. *" =>                                                                     "entry.884946379" ,
    "41.Я убежден, что если буду неосторожен, люди воспользуются этим. *" =>                                                       "entry.851921897" ,
    "42. Я не скоро замечаю дурное в людях. *" =>                                                                                  "entry.160851540" ,
    "43. Когда я читаю или слышу о трагедии, это не слишком трогает меня. *" =>                                                    "entry.1690658071",
    "44. Когда есть повод рассердиться, я предпочитаю основательно все обдумать. *" =>                                             "entry.1661888736",
    "45. Я испытываю сильную потребность в комплиментах. *" =>                                                                     "entry.1027933051",
    "46. Сексуальная невоздержанность отвратительна. *" =>                                                                         "entry.1873591511",
    "47. Когда в толпе кто-то мешает моему движению, у меня иногда возникает желание толкнуть его плечом. *" =>                    "entry.1861115174",
    "48. Как только что-нибудь не по-моему, я обижаюсь и мрачнею. *" =>                                                            "entry.1304411932",
    "49. Когда я вижу окровавленного человека на экране, это почти не волнует меня. *" =>                                          "entry.2043826486",
    "50. В сложных жизненных ситуациях я не могу обойтись без поддержки и помощи людей. *" =>                                      "entry.478349772" ,
    "51. Большинство окружающих считают меня очень интересным человеком. *" =>                                                     "entry.1330592207",
    "52. Я ношу одежду, которая скрывает недостатки моей фигуры. *" =>                                                             "entry.1534595942",
    "53. Для меня очень важно всегда придерживаться общепринятых правил поведения. *" =>                                           "entry.1223947537",
    "54. Я склонен часто противоречить людям. *" =>                                                                                "entry.2083955939",
    "55. Почти во всех семьях супруги друг другу изменяют. *" =>                                                                   "entry.1785723958",
    "56. По-видимому, я слишком отстранённо смотрю на вещи. *" =>                                                                  "entry.971602053" ,
    "57. В разговорах с представителями противоположного пола я стараюсь избегать щекотливых тем. *" =>                            "entry.667408156" ,
    "58. Когда у меня что-то не получается, мне иногда хочется плакать. *" =>                                                      "entry.238069482" ,
    "59. Из моей памяти часто выпадают некоторые мелочи. *" =>                                                                     "entry.478141681" ,
    "60. Когда кто-то толкает меня, я испытываю сильное негодование. *" =>                                                         "entry.1383086831",
    "61. Я выбрасываю из головы то, что мне не нравится. *" =>                                                                     "entry.517086088" ,
    "62. В любой неудаче я обязательно нахожу положительные стороны. *" =>                                                         "entry.851215358" ,
    "63. Я терпеть не могу людей, которые всегда стараются быть в центре внимания. *" =>                                           "entry.355276582" ,
    "64. Я почти ничего не выбрасываю и бережно храню множество разных вещей. *" =>                                                "entry.779904997" ,
    "65. В компании друзей мне больше всего нравятся разговоры о прошедших событиях, развлечениях и удовольствиях.*" =>            "entry.1402822361",
    "66. Меня не слишком раздражает детский плач. *" =>                                                                            "entry.1614217625",
    "67. Мне случалось так разозлиться, что я готов был перебить все вдребезги. *" =>                                              "entry.215653648" ,
    "68. Я всегда оптимистичен. *" =>                                                                                              "entry.387119863" ,
    "69. Я чувствую себя неуютно, когда на меня не обращают внимания.*" =>                                                         "entry.308221304" ,
    "70. Какие бы страсти не разыгрывались на экране, я всегда отдаю себе отчет в том, что это только на экране.*" =>              "entry.658286660" ,
    "71. Я часто испытываю чувство ревности. *" =>                                                                                 "entry.1214966243",
    "72. Я бы никогда специально не пошел на откровенно эротический фильм.*" =>                                                    "entry.1769135262",
    "73. Неприятно то, что людям, как правило, нельзя доверять.*" =>                                                               "entry.1431099220",
    "74. Я готов почти на все, чтобы произвести хорошее впечатление.*" =>                                                          "entry.1756628661",
    "75. Я никогда не бывал панически испуган. *" =>                                                                               "entry.339971641" ,
    "76. Я не упущу случая посмотреть хороший триллер или боевик.*" =>                                                             "entry.711550742" ,
    "77. Я думаю, что ситуация в мире лучше, чем полагает большинство людей.*" =>                                                  "entry.1608381577",
    "78. Даже небольшое разочарование может привести меня в уныние.*" =>                                                           "entry.1953407928",
    "79. Мне не нравится, когда люди откровенно флиртуют.*" =>                                                                     "entry.2080838778",
    "80. Я никогда не позволяю себе терять самообладание.*" =>                                                                     "entry.2060575900",
    "81. Я всегда готовлюсь к неудаче, чтобы не быть застигнутым врасплох.*" =>                                                    "entry.1991914166",
    "82. Кажется, некоторые из моих знакомых завидуют моему умению жить.*" =>                                                      "entry.1631197294",
    "83. Мне случалось со зла так сильно ударить или пнуть по чему-нибудь, что я неумышленно причинял себе боль.*" =>              "entry.429132285" ,
    "84. Я знаю, что за глаза кое-кто отзывается обо мне дурно. *" =>                                                              "entry.407463581" ,
    "85. Я едва ли могу вспомнить свои первые школьные годы. *" =>                                                                 "entry.889362211" ,
    "86. Когда я расстроен, я иногда веду себя по-детски. *" =>                                                                    "entry.1045268677",
    "87. Мне намного проще говорить о своих мыслях, чем о своих чувствах. *" =>                                                    "entry.393976123" ,
    "88. Когда я бываю в отъезде и у меня случаются неприятности, я сразу начинаю сильнотосковать по дому. *" =>                   "entry.669134154" ,
    "89. Когда я слышу о жестокостях, это не слишком глубоко трогает меня. *" =>                                                   "entry.1413979949",
    "90. Я легко переношу критику и замечания. *" =>                                                                               "entry.2020718415",
    "91. Я не скрываю своего раздражения по поводу привычек некоторых членов моей семьи.*" =>                                      "entry.1471050659",
    "92. Я знаю, что есть люди, настроенные против меня. *" =>                                                                     "entry.241030934" ,
    "93. Я не могу переживать свои неудачи в одиночку. *" =>                                                                       "entry.1701536784",
    "94. К счастью, у меня меньше проблем, чем имеет большинство людей. *" =>                                                      "entry.577008475" ,
    "95. Если что-то волнует меня, я иногда испытываю усталость и желание выспаться. *  " =>                                       "entry.1090633124",
    "96. Отвратительно то, что почти все люди, добившиеся успеха, достигли его с помощью лжи. *" =>                                "entry.2134269470",
    "97. Нередко я испытываю желание почувствовать в своих руках пистолет или автомат. *" =>                                       "entry.523145636"
];

$questions50 = [
    "1. ...я сосредотачивался на том, что мне нужно было делать дальше – на следующем шаге. *" => "entry.735285081",
    "2...начинал что-то делать, зная, что это все равно не будет работать, главное - делать хоть что-нибудь. *" => "entry.1331356536",
    "3. ...пытался склонить вышестоящих к тому, чтобы они изменили свое мнение. *" => "entry.62656123",
    "4. ... говорил с другими, чтобы больше узнать о ситуации. *" => "entry.632791869",
    "5. ... критиковал и укорял себя. *" => "entry.227483417",
    "6. ... пытался не сжигать за собой мосты, оставляя все, как оно есть. *" => "entry.1221289102",
    "7. ... надеялся на чудо. *" => "entry.1522013977",
    "8. ... смирялся с судьбой: бывает, что мне не везет. *" => "entry.1709756505",
    "9. ... вел себя, как будто ничего не произошло. *" => "entry.215150485",
    "10. ... старался не показывать своих чувств. *" => "entry.1579151517",
    "11. ... пытался увидеть в ситуации что-то положительное. *" => "entry.914954948",
    "12. ... спал больше обычного. *" => "entry.640212392",
    "13. ... срывал свою досаду на тех, кто навлек на меня проблемы. *" => "entry.781383911",
    "14. ... искал сочувствия и понимания у кого-нибудь. *" => "entry.1787005739",
    "15. ... во мне возникла потребность выразить себя творчески. *" => "entry.636620299",
    "16. ... пытался забыть все это. *" => "entry.1937985558",
    "17. ... обращался за помощью к специалистам. *" => "entry.2040945267",
    "18. ... менялся или рос как личность в положительную сторону. *" => "entry.759488312",
    "19. ... извинялся или старался все загладить. *" => "entry.381337710",
    "20. … составлял план действии. *" => "entry.1546063627",
    "21. ... старался дать какой-то выход своим чувствам. *" => "entry.104127988",
    "22. ... понимал, что сам вызвал эту проблему. *" => "entry.1853049926",
    "23. ... набирался опыта в этой ситуации. *" => "entry.117707500",
    "24. ... говорил с кем-либо, кто мог конкретно помочь в этой ситуации. *" => "entry.899064466",
    "25. ... пытался улучшить свое самочувствие едой, выпивкой, курением или лекарствами *" => "entry.63940437",
    "26. ... рисковал напропалую. *" => "entry.1725057539",
    "27. ... старался действовать не слишком поспешно, доверяясь первому по­рыву. *" => "entry.106355906",
    "28. ... находил новую веру во что-то. *" => "entry.54845433",
    "29. ... вновь открывал для себя что-то важное. *" => "entry.633771037",
    "30. ... что-то менял так, что все улаживалось. *" => "entry.910453558",
    "31. ... в целом избегал общения с людьми. *" => "entry.1862010112",
    "32. ... не допускал это до себя, стараясь об этом особенно не задумываться. *" => "entry.2106349299",
    "33. ... спрашивал совета у родственника или друга, которых уважал. *" => "entry.2118222712",
    "34. ... старался, чтобы другие не узнали, как плохо обстоят дела. *" => "entry.123044810",
    "35. ... отказывался воспринимать это слишком серьезно. *" => "entry.853745246",
    "36. ... говорил о том, что я чувствую. *" => "entry.1261093903",
    "37. ... стоял на своем и боролся за то, чего хотел. *" => "entry.39513806",
    "38. ... вымещал это на других людях. *" => "entry.1337094574",
    "39. ... пользовался прошлым опытом - мне приходилось уже попадать в такие ситуации. *" => "entry.1018263382",
    "40. ... знал, что надо делать и удваивал свои усилия, чтобы все наладить. *" => "entry.1017403085",
    "41. … отказывался верить, что это действительно произошло. *" => "entry.507096181",
    "42. ... я давал обещание, что в следующий раз все будет по-другому. *" => "entry.2004659668",
    "43. ... находил пару других способов решения проблемы. *" => "entry.575661768",
    "44. ... старался, что мои эмоции не слишком мешали мне в других делах. *" => "entry.522584449",
    "45. ... что-то менял в себе. *" => "entry.1273197046",
    "46. ... хотел, чтобы все это скорее как-то образовалось или кончилось. *" => "entry.1521041933",
    "47. ... представлял себе, фантазировал, как все это могло бы обернуться. *" => "entry.1842325148",
    "48. ... молился. *" => "entry.1025675777",
    "49. .. прокручивал в уме, что мне сказать или сделать. *" => "entry.1692416451",
    "50. ... думал о том, как бы в данной ситуации действовал человек, которым я восхищаюсь и старался подражать ему. *" => "entry.899761999"
];

$questions57 = [
   "1. Думаю, что большинство моих знакомых относится ко мне с симпатией. *" => "entry.1141468079",
   "2. Мои слова не так уж часто расходятся с делом. *" => "entry.1357891440",
   "3.Думаю, что многие видят во мне что-то сходное с собой. *" => "entry.342761871",
   "4. Когда я пытаюсь себя оценить, я прежде всего вижу свои недостатки. *" => "entry.723329655",
   "5. Думаю, что как личность я вполне могу быть притягательным для других. *" => "entry.1274143859",
   "6. Когда я вижу себя глазами любящего меня человека, меня неприятно поражает то, насколько мой образ далек от действительности. *" => "entry.1073870504",
   "7. Мое «Я» всегда мне интересно. *" => "entry.1280885744",
   "8. Я считаю, что иногда не грех пожалеть самого себя. *" => "entry.334281382",
   "9. В моей жизни есть или по крайней мере были люди с которыми я был чрезвычайно близок. *" => "entry.763757185",
   "10. Собственное уважение мне еще надо заслужить. *" => "entry.1014926832",
   "11. Бывало, и не раз, что я сам себя остро ненавидел. *" => "entry.1503543713",
   "12. Я вполне доверяю своим внезапно возникшим желаниям. *" => "entry.1790332873",
   "13. Я сам хотел во многом себя переделать. *" => "entry.1465595053",
   "14. Мое собственное «Я» не представляется мне чем-то достойным глубокого внимания. *" => "entry.1841960567",
   "15. Я искренне хочу, чтобы у меня было все хорошо в жизни. *" => "entry.767211927",
   "16. Если я и отношусь к кому-нибудь с укоризной, то прежде всего к самому себе. *" => "entry.1480321614",
   "17. Случайному знакомому я скорее всего покажусь человеком приятным. *" => "entry.189189575",
   "18. Чаще всего я одобряю свои планы и поступки. *" => "entry.192757201",
   "19. Собственные слабости вызывают у меня что-то наподобие презрения. *" => "entry.1350912160",
   "20. Если бы я раздвоился, то мне было бы довольно интересно общаться со своим двойником. *" => "entry.1955877894",
   "21. Некоторые свои качества я ощущаю как посторонние, чужие мне. *" => "entry.929544511",
   "22. Вряд ли кто-либо сможет почувствовать свое сходство со мной. *" => "entry.1835407168",
   "23. У меня достаточно способностей и энергии воплотить в жизнь задуманное. *" => "entry.732089902",
   "24. Часто я не без издевки подшучиваю над собой *" => "entry.662180803",
   "25. Самое разумное, что может сделать человек в своей жизни – это подчиниться собственной судьбе. *" => "entry.1657838372",
   "26. Посторонний человек, на первый взгляд, найдет во мне много отталкивающего. *" => "entry.1567388046",
   "27. К сожалению, если я и сказал что-то, это не значит, что именно так и буду поступать. *" => "entry.378015245",
   "28. Свое отношение к самому себе можно назвать дружеским. *" => "entry.1705880544",
   "29. Быть снисходительным к собственным слабостям вполне естественно. *" => "entry.588078146",
   "30. У меня не получается быть для любимого человека интересным длительное время. *" => "entry.2057303612",
   "31. В глубине души я бы хотел, чтобы со мной произошло что-то катастрофическое. *" => "entry.1786957386",
   "32. Вряд ли я вызываю симпатию у большинства моих знакомых. *" => "entry.1208607673",
   "33. Мне бывает очень приятно увидеть себя глазами любящего меня человека. *" => "entry.1019455824",
   "34. Когда у меня возникает какое-либо желание, я прежде всего спрашиваю у себя, разумно ли это. *" => "entry.811266893",
   "35. Иногда мне кажется, что если бы какой-то мудрый человек смог увидеть меня насквозь, он бы тут же понял, какое я ничтожество. *" => "entry.555933455",
   "36. Временами я сам собой восхищаюсь. *" => "entry.412852933",
   "37. Можно сказать, что я ценю себя достаточно высоко. *" => "entry.1780661511",
   "38. В глубине души я никак не могу поверить, что я действительно взрослый человек. *" => "entry.1663570349",
   "39. Без посторонней помощи я мало что могу сделать. *" => "entry.1964200546",
   "40. Иногда я сам себя плохо понимаю. *" => "entry.1855316633",
   "41. Мне очень мешает недостаток энергии, воли и целеустремленности. *" => "entry.879293742",
   "42. Думаю, что другие в целом оценивают меня достаточно высоко. *" => "entry.98451990",
   "43. В моей личности есть, наверное, что-то такое, что способно вызывать у других неприязнь. *" => "entry.1261336665",
   "44. Большинство моих знакомых не принимают меня так уж всерьез. *" => "entry.160247133",
   "45. Сам у себя я довольно часто вызываю чувство раздражения. *" => "entry.167197096",
   "46. Я вполне могу сказать, что унижаю себя сам. *" => "entry.695721393",
   "47. Даже мои негативные черты не кажутся мне чужими. *" => "entry.180119535",
   "48. В целом, меня устраивает то, какой я есть. *" => "entry.1191505043",
   "49. Вряд ли меня можно любить по-настоящему. *" => "entry.1593142615",
   "50. Моим мечтам и планам не хватает реалистичности. *" => "entry.289567543",
   "51. Если бы мое второе «Я» существовало, то для меня это был бы самый скучный партнер по общению. *" => "entry.13160112",
   "52. Думаю, что мог бы найти общий язык с любым разумным и знающим человеком. *" => "entry.1174066351",
    "53. То, что во мне происходит, как правило, мне понятно. *" => "entry.866484635",
    "54. Мои достоинства вполне перевешивают мои недостатки. *" => "entry.14128961",
    "55. Вряд ли найдется много людей, которые обвинят меня в отсутствии совести. *" => "entry.83278025",
    "56. Когда со мной случаются неприятности, как правило, я говорю: «И поделом тебе». *" => "entry.737757218",
    "57. Я могу сказать, что в целом я контролирую свою судьбу. *" => "entry.586410527",
];

$last_questions = [
    "1: Здоровье:" => "entry.1102762889",
    "2: Ум и способности:" => "entry.1098398770",
    "3: Характер:" => "entry.1084477950",
    "4: Отношение к окружающим:" =>"entry.339628924",
    "5: Внешность:" => "entry.1821763635",
    "6: Авторитет у сверстников:" => "entry.587763379",
    "7: Уверенность в себе:" => "entry.1169952182"
];

?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="utf-8">
    <script
            src="http://code.jquery.com/jquery-3.3.1.min.js"
            integrity="sha256-FgpCb/KJQlLNfOu91ta32o/NMZxltwRo8QtmkMRdAu8="
            crossorigin="anonymous"></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.12.9/umd/popper.min.js" integrity="sha384-ApNbgh9B+Y1QKtv3Rn7W3mgPxhU9K/ScQsAP7hUibX39j7fakFPskvXusvfa0b4Q" crossorigin="anonymous"></script>
    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
    <script src="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/js/bootstrap.min.js" integrity="sha384-JZR6Spejh4U02d8jOt6vLEHfe/JQGiRRSQQxSfFWpi1MquVdAyjUar5+76PVCmYl" crossorigin="anonymous"></script>
    <script src="jquery-ui.min.js"></script>
    <link rel="stylesheet" href="jquery-ui.min.css">
    
    <script>
        window.onload = function () {
            for (var i = 0; i < 7; i++) {
                var elem = $('#slider-vertical' + i);
                (function(i) {
                    elem.slider({
                        orientation: "vertical",
                        range: "min",
                        min: 0,
                        max: 100,
                        value: 0,
                        slide: function( event, ui ) {
                            $( "#amount" + i).val( ui.value );
                        }
                    });
                })(i);
                $( "#amount" + i).val(elem.slider( "value" ));
            }
        }
    </script>

    <style>
        .ui-slider-range {
            background: #50c1ff !important;
        }

        .ui-slider-vertical {
            background: #50c1ff !important;
        }
        .ui-slider-handle {
            /*padding-top: 3px !important;*/
            /*padding-bottom: 3px !important;*/
        }

        body {
            background: #e1e1e1;
        }

        hr {
            display: block;
            size: 30px;
            border: 0;
            border-top: 1px solid #559ecc;
            margin: 1em 0;
            padding: 0;
        }

        .main-container {
            margin-top: 20px;
            margin-bottom: 20px;
            border-radius: 7px;
            background: white;
            box-shadow: 0 0 10px #252529;
        }

        article {
            padding: 20px 10px;
        }
        
    </style>

</head>
<body>

<div class="container main-container">
    <article>
        <h3>Добро пожаловать</h3>
        <p>Спасибо, что Вы согласились поучаствовать в нашем исследовании!
            Вас ждут 4 части опросника, ответы на них помогут нам узнать о взаимосвязи между самооценкой и стратегиями поведения, которые помогают человеку справляться со стрессом и другими трудными жизненными ситуациями.
            Заполняя опросник, не думайте слишком долго, отвечайте то, что первое приходит к Вам в голову! Помните, здесь нет правильных или неправильных ответов! В общей сложности это может занять у Вас около 20 -40 минут.
            Ваши результаты будут записаны анонимно, и использованы только во благо науки!

            Большое спасибо за Вашу помощь!
        </p>

        <form method="post" action="https://docs.google.com/forms/d/e/1FAIpQLSfhpUYhaCbn-iMpHtlmrwGzBNze56lGaeCH0MGhymooKwfuGA/formResponse">
            <hr>
            <h3>Немного информации о Вас)</h3>

            <p>Ваш пол:</p>
            <div class="form-check">
                <input type="radio" class="form-check-input" value="М" id="Mpol" name="entry.959163167">
                <label class="form-check-label" for="Mpol">М</label>
            </div>
            <div class="form-check">
                <input type="radio"  class="form-check-input" value="Ж" id="JPol" name="entry.959163167">
                <label class="form-check-label" for="JPol">Ж</label>
            </div>

            <div class="form-group">
                <label for="age">Ваш возраст:</label>
                <input type="text" class="form-control" id="age" name="entry.1156004952">
            </div>

            <div class="form-group">
                <label for="education">Ваше образованиe:</label>
                <input type="text" id="education" class="form-control" name="entry.363057680">
            </div>

            <hr>

            <h3>Начнем!</h3>
            <p>Вам будут предложены 97 утверждений, с которыми Вы можете согласиться или не согласиться выбрав ответ "ДА" или "НЕТ".</p>
            <?php $i = 0; ?>
            <?php foreach($questions97 as $key => $question): ?>
                <p><?php echo $key ?></p>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "1" ?>" value="Да" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "1"?>">Да</label>
                </div>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "2" ?>" value="Нет" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "2"?>">Нет</label>
                </div>
                <?php $i++; ?>
            <?php endforeach; ?>

            <br>
            <hr>
            <h3>Отдохните немного)</h3>
            <p>Вас ждут 50 утверждений, которые касаются поведения в трудных жизненных ситуациях.Оцените, как часто то или иное поведение встречается у Вас.</p>
            <h3>ОКАЗАВШИСЬ В ТРУДНОЙ СИТУАЦИИ, ...</h3>
            <?php $i = 0; ?>
            <?php foreach ($questions50 as $key => $question): ?>
                <p><?php echo $key ?></p>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "1" ?>" value="Никогда" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "1"?>">Никогда</label>
                </div>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "2" ?>" value="Редко" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "2"?>">Редко</label>
                </div>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "3" ?>" value="Иногда" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "3"?>">Иногда</label>
                </div>
                <div class="form-check">
                    <input class="form-check-input" type="radio" id="<?php echo $question . "4" ?>" value="Часто" name="<?php echo $question ?>">
                    <label class="form-check-label" for="<?php echo $question . "4"?>">Часто</label>
                </div>
                <?php $i++; ?>
            <?php endforeach; ?>

            <br>
            <hr>
            <h3>Вы молодец! Немного разомнитесь!</h3>
            <p>Вам предлагается ответить на следующие 57 утверждений. Если Вы согласны с данным утверждением отмечайте "да", если не согласны, то выбирайте ответ "нет".
            </p>

            <?php $i = 0; ?>
            <?php foreach ($questions57 as $key => $question): ?>
                <p><?php echo $key ?></p>
                <input type="radio" id="<?php echo $question . "1" ?>" value="Да" name="<?php echo $question ?>">
                <label for="<?php echo $question . "1"?>">Да</label>
                <input type="radio" id="<?php echo $question . "2" ?>" value="Нет" name="<?php echo $question ?>">
                <label for="<?php echo $question . "2"?>">Нет</label>
                <?php $i++; ?>
            <?php endforeach; ?>

            <br>
            <hr>
            <h3>Последний рывок! Здесь совсем чуть-чуть!</h3>
            <p>
                В этой части Вам нужно будет оценить самого себя с помощью 10-ми бальной шкалы по ниже перечисленным параметрам, где 1- это самый минимальный показатель, а 10- максимальный. Например, если бы все люди разделились по росту, тогда 1- это самый маленький рост на земле, а 10- самый высокий. Вам нужно выбрать, где находитесь Вы, относительно этих параметров!
            </p>

            <?php $i = 0; ?>
            <?php foreach ($last_questions as $key => $question): ?>
                <div style="margin-top: 70px;">
                    <div class="row">
                        <p><?php echo $key ?></p>
                    </div>
                    <div class="form-check">
                        <div id="slider-vertical<?php echo $i; ?>" style="height:400px;"></div>
                        <p>
                            <input hidden class="form-check-input" type="text" name="<?php echo $question ?>" id="amount<?php echo $i; ?>" style="border:0; color:#f6931f; font-weight: lighter;" />
                        </p>
                    </div>
                </div>
                <?php $i++; ?>
            <?php endforeach; ?>

            <button type="submit" class="btn btn-primary">Submit</button>
        </form>
    </article>
</div>
</body>
</html>
